{
  "resume": {
    "title": "Sergey Tashlikovich, React Frontend Developer",
    "contacts": {
      "email": "E-mail: sergeu-tash@yandex.ru",
      "phone": "Phone: +7(989)049-17-01",
      "telegram": "Telegram: @sqvrty",
      "website": "Portfolio: https://stash-cv.website",
      "location": "Location: Moscow, Russia"
    },
    "about": {
      "title": "About Me",
      "content": "Experienced in building both simple landing pages and complex high-load applications (50+ pages) with deep performance optimization. Worked as a freelancer, which taught me to communicate effectively with clients and meet tight deadlines. Constantly research native <strong>JS</strong> and frameworks, follow trends through industry resources. Have entrepreneurial experience - proposed solutions to clients that increased their sales. Fluent in English. Excited to work in a company that shares a passion for technology."
    },
    "skills": {
      "title": "Skills",
      "content": "JavaScript, TypeScript, React.js, Next.js, Redux, Redux Toolkit, HTML, CSS (flex, grid), Tailwind CSS, Git, REST API, Webpack, Vite, Jest, React Testing Library (RTL), ES Lint, English B2+"
    },
    "experience": {
      "title": "Work Experience",
      "professional": "Pre-professional experience",
      "stack": "Stack"
    },
    "education": {
      "title": "Education",
      "period": "2022 — 2026",
      "content": "Computer Science 09.03.01, Bauman Moscow State Technical University"
    },
    "workExperience": [
      {
        "post": "React/React Native Frontend Developer",
        "companyName": "EmotionalEgghead",
        "dateStart": "August 2023",
        "dateEnd": "April 2024",
        "desc": "Developed a Next.js SPA from scratch (50+ pages): SSR/SSG for SEO, dynamic routes, multilingual support (i18n).<br/>Key implementations: role-based access system with JWT auth, video platform with custom player, interactive dashboards with charts (Chart.js).<br/>Performance optimization: reduced TTI by 35% via code splitting + lazy loading, decreased bundle size by 30% (Webpack Bundle Analyzer), configured API caching (SWR).<br/>Processes & collaboration: set up CI/CD (GitHub Actions), close work with CEO - proposed business logic solutions (boosted conversion by 20%), received product co-ownership offer for significant contributions.",
        "stack": "Next.js, React, TypeScript, Redux Toolkit, Redux Thunk, Vite, MUI, CSS Modules"
      },
      {
        "post": "React Frontend Developer",
        "companyName": "Black Wall Group",
        "dateStart": "November 2022",
        "dateEnd": "May 2023",
        "desc": "Developed an admin panel for a mobile app alongside a Middle+ Frontend Developer.<br/>Key tasks: implemented complex forms and validation, created reusable UI components, optimized builds, conducted code reviews and joint codebase refactoring.",
        "stack": "React, TypeScript, Redux Toolkit, Prime React, Webpack, Git Flow"
      }
    ],
    "nonCommercialExperience": [
      {
        "post": "Freelance",
        "stack": "Vue 2/3, React, Redux, Effector, Zustand, Tailwind..",
        "dateStart": "June 2022",
        "dateEnd": "July 2023"
      },
      {
        "post": "JavaScript Instructor",
        "stack": "JavaScript",
        "dateStart": "September 2022",
        "dateEnd": "November 2022"
      }
    ]
  }
}
